========
decorate
========
decorate
---
(command
  (decorate))


===============
decorate (input
===============
decorate (input
---
(command
  (decorate
  (component)))


=====================
decorate (input audio
=====================
decorate (input audio
---
(command
  (decorate
  (component
    (name))))


===============================
decorate (input audio) with Pad
===============================
decorate (input audio) with Pad
---
(command
  (decorate
    (component
      (name)
      (decoration
        (name)))))


=================
delete decoration
=================
delete decoration
---
(command
  (delete
    (decoration)))


====================
delete decoration d1
====================
delete decoration d1
---
(command
  (delete
    (decoration
      (identifier))))

        
============================
delete decoration (input i1)
============================
delete decoration (input i1)
---
(command
  (delete
    (decoration
      (input
        (identifier)))))


============================
delete decoration (input i1)
============================
delete decoration (input i1)
---
(command
  (delete
    (decoration
      (input
        (identifier)))))


================================================
delete decoration (input i1) CircularGraduations
================================================
delete decoration (input i1) CircularGraduations
---
(command
  (delete
    (decoration
      (input
        (identifier))
      (name))))


==============
set decoration
==============
set decoration
---
(command
  (set
    (decoration)))


=================
set decoration d1
=================
set decoration d1
---
(command
  (set
    (decoration
      (identifier))))


=========================
set decoration d1 x +10mm
=========================
set decoration d1 x +10mm
---
(command
  (set
    (decoration
      (identifier))
    (offset)))


=========================
set decoration d1 y +10mm
=========================
set decoration d1 y +10mm
---
(command
  (set
    (decoration
      (identifier))
    (offset)))


================================
set decoration d1 xy +10mm,-10mm
================================
set decoration d1 xy +10mm,-10mm
---
(command
  (set
    (decoration
      (identifier))
    (offset)
    (offset)))


===================================
set decoration d1 (stretch 1.1,0.9)
===================================
set decoration d1 (stretch 1.1,0.9)
---
(command
  (set
    (decoration
      (identifier))
    (stretch)))


=============================
set decoration d1 (scale 0.5)
=============================
set decoration d1 (scale 0.5)
---
(command
  (set
    (decoration
      (identifier))
    (scale)))
