=========
new input 
=========
new input
---
(command
  (new
    (input)))


===========
new input e
===========
new input e
---
(command
  (new
    (input
      (name))))


======================
new input e @10mm,10mm
======================
new input e @10mm,10mm
---
(command
  (new
    (input
      (name)
      (xy))))


==============================
new input "e" 10mm,10mm PJ301M
==============================
new input "e" 10mm,10mm PJ301M
---
(command
  (new
    (input
      (name)
      (xy)
      (part))))


============
delete input
============
delete input
---
(command
  (delete
    (input)))


===============
delete input v1
===============
delete input v1
---
(command
  (delete
    (input
      (identifier))))


=========
set input
=========
set input
---
(command
  (set
    (input)))


============
set input i1
============
set input i1
---
(command
  (set
    (input
      (identifier))))


=========================
set input i1 name 'audio'
=========================
set input i1 name 'audio'
---
(command
  (set
    (input
      (identifier))
    (name)))


===================
set input i1 x 10mm
===================
set input i1 x 10mm
---
(command
  (set
    (input
      (identifier))
    (x)))


===================
set input i1 y 10mm
===================
set input i1 y 10mm
---
(command
  (set
    (input
      (identifier))
    (y)))


==========================
set input in part 'PJ301M'
==========================
set input in part 'PJ301M'
---
(command
  (set
    (input
      (identifier))
    (part)))
