=========
new label
=========
new label
---
(command
  (new
    (label)))

=================
new label "lorem"
=================
new label "lorem"
---
(command
  (new
    (label
      (string))))


============================
new label "lorem" @10mm,10mm
============================
new label "lorem" @10mm,10mm
---
(command
  (new
    (label
      (string
        (absolute)))))
        
===========================
new label "lorem" 10mm,10mm
===========================
new label "lorem" 10mm,10mm
---
(command
  (new
    (label
      (string
        (relative)))))


===============================
new label "lorem" centre,middle
===============================
new label "lorem" centre,middle
---
(command
  (new
    (label
      (string
        (geometry)))))


=======================================
new label "lorem" 10mm,10mm "Lato-Bold"
=======================================
new label "lorem" 10mm,10mm "Lato-Bold"
---
(command
  (new
    (label
      (string
        (relative
          (font))))))


============================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt
============================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt
---
(command
  (new
    (label
      (string
        (relative
          (font
            (fontsize)))))))


===================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre
===================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre
---
(command
  (new
    (label
      (string
        (relative
          (font
            (fontsize
              (halign))))))))


============================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline
============================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline
---
(command
  (new
    (label
      (string
        (relative
          (font
            (fontsize
              (halign
                (valign)))))))))


====================================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline #ff0000
====================================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline #ff0000
---
(command
  (new
    (label
      (string
        (relative
          (font
            (fontsize
              (halign
                (valign
                  (colour))))))))))


============
delete label
============
delete label
---
(command
  (delete
    (label)))


===============
delete label t1
===============
delete label t1
---
(command
  (delete
    (label
      (identifier))))

        
=======================
delete label "εsθaδxδy"
=======================
delete label "εsθaδxδy"
---
(command
  (delete
    (label
      (identifier))))


=======================
delete label 'εsθaδxδy'
=======================
delete label 'εsθaδxδy'
---
(command
  (delete
    (label
      (identifier))))


==========
set label
==========
set label
---
(command
  (set
    (label)))


===============
set label lorem
===============
set label lorem
---
(command
  (set
    (label
      (identifier))))


==============================
set label 'lorem' text 'ipsum'
==============================
set label 'lorem' text 'ipsum'
---
(command
  (set
    (label
      (identifier))
    (string)))


========================
set label 'lorem' x 10mm
========================
set label 'lorem' x 10mm
---
(command
  (set
    (label
      (identifier))
    (x)))


======================
set label lorem y 10mm
======================
set label lorem y 10mm
---
(command
  (set
    (label
      (identifier))
    (y)))


============================
set label lorem xy 10mm,10mm
============================
set label lorem xy 10mm,10mm
---
(command
  (set
    (label
      (identifier))
    (xy)))


==================================
set label 'lorem' font 'ComicSans'
==================================
set label 'lorem' font 'ComicSans'
---
(command
  (set
    (label
      (identifier))
    (font)))


===================================
set label "lorem" font 'ComicSans'
==================================
set label "lorem" font 'ComicSans'
---
(command
  (set
    (label
      (identifier))
    (font)))


===========================
set label 'lorem' size 14pt
===========================
set label 'lorem' size 14pt
---
(command
  (set
    (label
      (identifier))
    (fontsize)))


=============================
set label 'lorem' halign left
=============================
set label 'lorem' halign left
---
(command
  (set
    (label
      (identifier))
    (halign)))


============================
set label 'lorem' valign top
============================
set label 'lorem' valign top
---
(command
  (set
    (label
      (identifier))
    (valign)))


================================
set label 'lorem' align left,top
================================
set label 'lorem' align left,top
---
(command
  (set
    (label
      (identifier))
    (halign)
    (valign)))


================================
set label 'lorem' colour #ff0000
================================
set label 'lorem' colour #ff0000
---
(command
  (set
    (label
      (identifier))
    (colour)))


===============================
set label 'lorem' color #ff0000
===============================
set label 'lorem' color #ff0000
---
(command
  (set
    (label
      (identifier))
    (colour)))


