=========
new label
=========
new label
---
(command
  (new
    (label)))

=================
new label "lorem"
=================
new label "lorem"
---
(command
  (new
    (label
      (string))))


============================
new label "lorem" @10mm,10mm
============================
new label "lorem" @10mm,10mm
---
(command
  (new
    (label
      (string)
      (absolute
        (x)
        (y)))))


===========================
new label "lorem" 10mm,10mm
===========================
new label "lorem" 10mm,10mm
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y)))))


===============================
new label "lorem" centre,middle
===============================
new label "lorem" centre,middle
---
(command
  (new
    (label
      (string)
      (x
        (reference))
      (y
        (reference)))))


=======================================
new label "lorem" 10mm,10mm "Lato-Bold"
=======================================
new label "lorem" 10mm,10mm "Lato-Bold"
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font))))


