======================
set background #ff00ed
======================
set background #ff00ed
---
(command
  (set
    (background
      (rgb))))


==============================
set background #ff00ed,#00ffed
==============================
set background #ff00ed,#00ffed
---
(command
  (set
    (background
      (rgb)
      (rgb))))


========================
set background #ff00ed40
========================
set background #ff00ed40
---
(command
  (set
    (background
      (rgba))))


==================================
set background #ff00ed40,#00ffed40
==================================
set background #ff00ed40,#00ffed40
---
(command
  (set
    (background
      (rgba)
      (rgba))))


=========================
set background foundation
=========================
set background foundation
---
(command
  (set
    (background
      (name))))

===========================
set background 'foundation'
===========================
set background 'foundation'
---
(command
  (set
    (background
      (name))))


===========================
set background "foundation"
===========================
set background "foundation"
---
(command
  (set
    (background
      (name))))
