========================
new input "e" @10mm,10mm
========================
new input "e" @10mm,10mm
---
(command
  (new
    (input
      (name)
      (absolute
        (x)
        (y)))))


===============================
new input "e" @10mm,10mm PJ301M
===============================
new input "e" @10mm,10mm PJ301M
---
(command
  (new
    (input
      (name)
      (absolute
        (x)
        (y))
      (part))))


=================================
new input "e" @10mm,10mm "PJ301M"
=================================
new input "e" @10mm,10mm "PJ301M"
---
(command
  (new
    (input
      (name)
      (absolute
        (x)
        (y))
      (part))))


=================================
new input "e" @10mm,10mm 'PJ301M'
=================================
new input "e" @10mm,10mm 'PJ301M'
---
(command
  (new
    (input
      (name)
      (absolute
        (x)
        (y))
      (part))))


======================
new input "e" left,top
======================
new input "e" left,top
---
(command
  (new
    (input
      (name)
      (x
        (reference))
      (y
        (reference)))))


===============================
new input "e" left,top "PJ301M"
===============================
new input "e" left,top "PJ301M"
---
(command
  (new
    (input
      (name)
      (x
        (reference))
      (y
        (reference))
        (part))))


==================================
new input "e" left+4.5mm,top+4.5mm
==================================
new input "e" left+4.5mm,top+4.5mm
---
(command
  (new
    (input
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


===========================================
new input "e" left+4.5mm,top+4.5mm "PJ301M"
===========================================
new input "e" left+4.5mm,top+4.5mm "PJ301M"
---
(command
  (new
    (input
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset))
      (part))))
