============================
new label "lorem" @10mm,10mm
============================
new label "lorem" @10mm,10mm
---
(command
  (new
    (label
      (string)
      (absolute
        (x)
        (y)))))


===========================
new label "lorem" 10mm,10mm
===========================
new label "lorem" 10mm,10mm
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y)))))


===============================
new label "lorem" centre,middle
===============================
new label "lorem" centre,middle
---
(command
  (new
    (label
      (string)
      (x
        (reference))
      (y
        (reference)))))


=========================================
new label "lorem" centre+10mm,middle-10mm
=========================================
new label "lorem" centre+10mm,middle-10mm
---
(command
  (new
    (label
      (string)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


=======================
new label "lorem" v1,h1
=======================
new label "lorem" v1,h1
---
(command
  (new
    (label
      (string)
      (x
        (reference))
      (y
        (reference)))))


=================================
new label "lorem" v1+10mm,h1-10mm
=================================
new label "lorem" v1+10mm,h1-10mm
---
(command
  (new
    (label
      (string)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


=======================================
new label "lorem" 10mm,10mm "Lato-Bold"
=======================================
new label "lorem" 10mm,10mm "Lato-Bold"
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font))))


============================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt
============================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font)
      (fontsize))))


================================
new label "lorem" 10mm,10mm 14pt
================================
new label "lorem" 10mm,10mm 14pt
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (fontsize))))


===================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre
===================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font)
      (fontsize)
      (halign))))


=======================================
new label "lorem" 10mm,10mm 14pt centre
=======================================
new label "lorem" 10mm,10mm 14pt centre
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (fontsize)
      (halign))))


==================================
new label "lorem" 10mm,10mm centre
==================================
new label "lorem" 10mm,10mm centre
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (halign))))
