============================
new label "lorem" @10mm,10mm
============================
new label "lorem" @10mm,10mm
---
(command
  (new
    (label
      (string)
      (absolute
        (x)
        (y)))))


===========================
new label "lorem" 10mm,10mm
===========================
new label "lorem" 10mm,10mm
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y)))))


===============================
new label "lorem" centre,middle
===============================
new label "lorem" centre,middle
---
(command
  (new
    (label
      (string)
      (x
        (reference))
      (y
        (reference)))))


=========================================
new label "lorem" centre+10mm,middle-10mm
=========================================
new label "lorem" centre+10mm,middle-10mm
---
(command
  (new
    (label
      (string)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


=======================
new label "lorem" v1,h1
=======================
new label "lorem" v1,h1
---
(command
  (new
    (label
      (string)
      (x
        (reference))
      (y
        (reference)))))


=================================
new label "lorem" v1+10mm,h1-10mm
=================================
new label "lorem" v1+10mm,h1-10mm
---
(command
  (new
    (label
      (string)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


=======================================
new label "lorem" (input e +10mm,-10mm)
======================================
new label "lorem" (input e +10mm,-10mm)
---
(command
  (new
    (label
      (string)
      (decorate
        (input)
        (name)
        (dx)
        (dy)))))


===========================================
new label "lorem" (parameter E +10mm,-10mm)
===========================================
new label "lorem" (parameter E +10mm,-10mm)
---
(command
  (new
    (label
      (string)
      (decorate
        (parameter)
        (name)
        (dx)
        (dy)))))


=============================================
new label "lorem" (label "lorem" +10mm,-10mm)
=============================================
new label "lorem" (label "lorem" +10mm,-10mm)
---
(command
  (new
    (label
      (string)
      (decorate
        (label)
        (name)
        (dx)
        (dy)))))


=======================================
new label "lorem" 10mm,10mm "Lato-Bold"
=======================================
new label "lorem" 10mm,10mm "Lato-Bold"
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font))))


============================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt
============================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font)
      (fontsize))))


================================
new label "lorem" 10mm,10mm 14pt
================================
new label "lorem" 10mm,10mm 14pt
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (fontsize))))


===================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre
===================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font)
      (fontsize)
      (halign))))


=======================================
new label "lorem" 10mm,10mm 14pt centre
=======================================
new label "lorem" 10mm,10mm 14pt centre
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (fontsize)
      (halign))))


==================================
new label "lorem" 10mm,10mm centre
==================================
new label "lorem" 10mm,10mm centre
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (halign))))


============================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline
============================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font)
      (fontsize)
      (halign)
      (valign))))


================================================
new label "lorem" 10mm,10mm 14pt centre,baseline
================================================
new label "lorem" 10mm,10mm 14pt centre,baseline
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (fontsize)
      (halign)
      (valign))))


===========================================
new label "lorem" 10mm,10mm centre,baseline
===========================================
new label "lorem" 10mm,10mm centre,baseline
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (halign)
      (valign))))


===========================================
new label "lorem" 10mm,10mm baseline,centre
===========================================
new label "lorem" 10mm,10mm baseline,centre
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (valign)
      (halign))))


====================================
new label "lorem" 10mm,10mm baseline
====================================
new label "lorem" 10mm,10mm baseline
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (valign))))


====================================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline #ff0000
====================================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline #ff0000
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font)
      (fontsize)
      (halign)
      (valign)
      (colour
        (rgb)))))


======================================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline #ff0000aa
======================================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline #ff0000aa
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font)
      (fontsize)
      (halign)
      (valign)
      (colour
        (rgba)))))


========================================================
new label "lorem" 10mm,10mm 14pt centre,baseline #ff0000
========================================================
new label "lorem" 10mm,10mm 14pt centre,baseline #ff0000
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (fontsize)
      (halign)
      (valign)
      (colour 
        (rgb)))))


===================================================
new label "lorem" 10mm,10mm centre,baseline #ff0000
===================================================
new label "lorem" 10mm,10mm centre,baseline #ff0000
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (halign)
      (valign)
      (colour 
        (rgb)))))


==========================================
new label "lorem" 10mm,10mm centre #ff0000
==========================================
new label "lorem" 10mm,10mm centre #ff0000
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (halign)
      (colour
        (rgb)))))


============================================
new label "lorem" 10mm,10mm baseline #ff0000
============================================
new label "lorem" 10mm,10mm baseline #ff0000
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (valign)
      (colour 
        (rgb)))))


===================================
new label "lorem" 10mm,10mm #ff0000
===================================
new label "lorem" 10mm,10mm #ff0000
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (colour
        (rgb)))))


============================================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline #ff0000,#00ff00
============================================================================
new label "lorem" 10mm,10mm "Lato-Bold" 14pt centre,baseline #ff0000,#00ff00
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (font)
      (fontsize)
      (halign)
      (valign)
      (colour
        (rgb)
        (rgb)))))


================================================================
new label "lorem" 10mm,10mm 14pt centre,baseline #ff0000,#00ff00
================================================================
new label "lorem" 10mm,10mm 14pt centre,baseline #ff0000,#00ff00
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (fontsize)
      (halign)
      (valign)
      (colour
        (rgb)
        (rgb)))))


===========================================================
new label "lorem" 10mm,10mm centre,baseline #ff0000,#00ff00
===========================================================
new label "lorem" 10mm,10mm centre,baseline #ff0000,#00ff00
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (halign)
      (valign)
      (colour
        (rgb)
        (rgb)))))


==================================================
new label "lorem" 10mm,10mm centre #ff0000,#00ff00
==================================================
new label "lorem" 10mm,10mm centre #ff0000,#00ff00
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (halign)
      (colour
        (rgb)
        (rgb)))))


====================================================
new label "lorem" 10mm,10mm baseline #ff0000,#00ff00
====================================================
new label "lorem" 10mm,10mm baseline #ff0000,#00ff00
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (valign)
      (colour
        (rgb)
        (rgb)))))


===========================================
new label "lorem" 10mm,10mm #ff0000,#00ff00
===========================================
new label "lorem" 10mm,10mm #ff0000,#00ff00
---
(command
  (new
    (label
      (string)
      (relative
        (x)
        (y))
      (colour
        (rgb)
        (rgb)))))


===============================
new label "εsθaδxδy" @10mm,10mm
===============================
new label "εsθaδxδy" @10mm,10mm
---
(command
  (new
    (label
      (string)
      (absolute
        (x)
        (y)))))


===============================
new label 'εsθaδxδy' @10mm,10mm
===============================
new label 'εsθaδxδy' @10mm,10mm
---
(command
  (new
    (label
      (string)
      (absolute
        (x)
        (y)))))


================
delete label t1
================
delete label t1
---
(command
  (delete
    (label
      (identifier))))


===================
delete label volume
===================
delete label volume
---
(command
  (delete
    (label
      (identifier))))

        
=======================
delete label "εsθaδxδy"
=======================
delete label "εsθaδxδy"
---
(command
  (delete
    (label
      (identifier))))


=======================
delete label 'εsθaδxδy'
=======================
delete label 'εsθaδxδy'
---
(command
  (delete
    (label
      (identifier))))


==========================
set label lorem text ipsum
==========================
set label lorem text ipsum
---
(command
  (set
    (label
      (identifier))
    (string)))


==============================
set label 'lorem' text 'ipsum'
==============================
set label 'lorem' text 'ipsum'
---
(command
  (set
    (label
      (identifier))
    (string)))


==============================
set label "lorem" text "ipsum"
==============================
set label "lorem" text "ipsum"
---
(command
  (set
    (label
      (identifier))
    (string)))


=========================
set label 'lorem' x @10mm
=========================
set label 'lorem' x @10mm
---
(command
  (set
    (label
      (identifier))
    (x
      (absolute)
      (offset))))


========================
set label 'lorem' x 10mm
========================
set label 'lorem' x 10mm
---
(command
  (set
    (label
      (identifier))
    (x
      (offset))))


=============================
set label 'lorem' x left+10mm
=============================
set label 'lorem' x left+10mm
---
(command
  (set
    (label
      (identifier))
    (x
      (reference)
      (offset))))


===========================
set label 'lorem' x v1+10mm
===========================
set label 'lorem' x v1+10mm
---
(command
  (set
    (label
      (identifier))
    (x
      (reference)
      (offset))))


=========================
set label 'lorem' y @10mm
=========================
set label 'lorem' y @10mm
---
(command
  (set
    (label
      (identifier))
    (y
      (absolute)
      (offset))))


========================
set label 'lorem' y 10mm
========================
set label 'lorem' y 10mm
---
(command
  (set
    (label
      (identifier))
    (y
      (offset))))


============================
set label 'lorem' y top+10mm
============================
set label 'lorem' y top+10mm
---
(command
  (set
    (label
      (identifier))
    (y
      (reference)
      (offset))))


===========================
set label 'lorem' y h1+10mm
===========================
set label 'lorem' y h1+10mm
---
(command
  (set
    (label
      (identifier))
    (y
      (reference)
      (offset))))


===============================
set label 'lorem' xy @10mm,10mm
===============================
set label 'lorem' xy @10mm,10mm
---
(command
  (set
    (label
      (identifier))
    (xy
      (absolute)
      (x
        (offset))
      (y
        (offset)))))


==============================
set label 'lorem' xy 10mm,10mm
==============================
set label 'lorem' xy 10mm,10mm
---
(command
  (set
    (label
      (identifier))
    (xy
      (x
        (offset))
      (y
        (offset)))))


==========================================
set label 'lorem' xy left+10mm,middle+10mm
==========================================
set label 'lorem' xy left+10mm,middle+10mm
---
(command
  (set
    (label
      (identifier))
    (xy
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


====================================
set label 'lorem' xy v1+10mm,h2+10mm
====================================
set label 'lorem' xy v1+10mm,h2+10mm
---
(command
  (set
    (label
      (identifier))
    (xy
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


============================
set label lorem x (input in)
============================
set label lorem x (input in)
---
(command
  (set
    (label
      (identifier))
    (x
      (input
        (name)))))


==================================
set label lorem x (input in +10mm)
==================================
set label lorem x (input in +10mm)
---
(command
  (set
    (label
      (identifier))
    (x
      (input
        (name)
        (offset)))))


============================
set label lorem y (input in)
============================
set label lorem y (input in)
---
(command
  (set
    (label
      (identifier))
    (y
      (input
        (name)))))


==================================
set label lorem y (input in +10mm)
==================================
set label lorem y (input in +10mm)
---
(command
  (set
    (label
      (identifier))
    (y
      (input
        (name)
        (offset)))))

=============================
set label lorem xy (input in)
=============================
set label lorem xy (input in)
---
(command
  (set
    (label
      (identifier))
    (xy
      (input
        (name)))))

=========================================
set label lorem xy (input in +10mm,+10mm)
=========================================
set label lorem xy (input in +10mm,+10mm)
---
(command
  (set
    (label
      (identifier))
    (xy
      (input
        (name)
        (x
          (offset))
        (y
          (offset))))))


==================================
set label 'lorem' font 'ComicSans'
==================================
set label 'lorem' font 'ComicSans'
---
(command
  (set
    (label
      (identifier))
    (font)))


===========================
set label 'lorem' size 14pt
===========================
set label 'lorem' size 14pt
---
(command
  (set
    (label
      (identifier))
    (fontsize)))


=============================
set label 'lorem' halign left
=============================
set label 'lorem' halign left
---
(command
  (set
    (label
      (identifier))
    (halign)))


============================
set label 'lorem' valign top
============================
set label 'lorem' valign top
---
(command
  (set
    (label
      (identifier))
    (valign)))


================================
set label 'lorem' align left,top
================================
set label 'lorem' align left,top
---
(command
  (set
    (label
      (identifier))
    (halign)
    (valign)))


===============================
set label 'lorem' color #ff0000
===============================
set label 'lorem' color #ff0000
---
(command
  (set
    (label
      (identifier))
    (colour
      (rgb))))


================================
set label 'lorem' colour #ff0000
================================
set label 'lorem' colour #ff0000
---
(command
  (set
    (label
      (identifier))
    (colour
      (rgb))))


========================================
set label 'lorem' colour #ff0000,#00ff00
========================================
set label 'lorem' colour #ff0000,#00ff00
---
(command
  (set
    (label
      (identifier))
    (colour
      (rgb)
      (rgb))))


==================================
set label 'lorem' colour #ff000040
==================================
set label 'lorem' colour #ff000040
---
(command
  (set
    (label
      (identifier))
    (colour
      (rgba))))


============================================
set label 'lorem' colour #ff000040,#00ff0080
============================================
set label 'lorem' colour #ff000040,#00ff0080
---
(command
  (set
    (label
      (identifier))
    (colour
      (rgba)
      (rgba))))

