=======================
new light on @10mm,10mm
=======================
new light on @10mm,10mm
---
(command
  (new
    (light
      (name)
      (absolute
        (x)
        (y)))))


======================
new light on 10mm,10mm
======================
new light on 10mm,10mm
---
(command
  (new
    (light
      (name)
      (relative
        (x)
        (y)))))


========================
new light 'on' 10mm,10mm
========================
new light 'on' 10mm,10mm
---
(command
  (new
    (light
      (name)
      (relative
        (x)
        (y)))))


========================
new light "on" 10mm,10mm
========================
new light "on" 10mm,10mm
---
(command
  (new
    (light
      (name)
      (relative
        (x)
        (y)))))


============================
new light "on" 10mm,10mm LED
============================
new light "on" 10mm,10mm LED
---
(command
  (new
    (light
      (name)
      (relative
        (x)
        (y))
        (part))))


==============================
new light "on" 10mm,10mm 'LED'
==============================
new light "on" 10mm,10mm 'LED'
---
(command
  (new
    (light
      (name)
      (relative
        (x)
        (y))
        (part))))


==============================
new light "on" 10mm,10mm "LED"
==============================
new light "on" 10mm,10mm "LED"
---
(command
  (new
    (light
      (name)
      (relative
        (x)
        (y))
        (part))))


=======================
new light "on" left,top
=======================
new light "on" left,top
---
(command
  (new
    (light
      (name)
      (x
        (reference))
      (y
        (reference)))))


=============================
new light "on" left,top "LED"
=============================
new light "on" left,top "LED"
---
(command
  (new
    (light
      (name)
      (x
        (reference))
      (y
        (reference))
      (part))))


===================================
new light "on" left+4.5mm,top+4.5mm
===================================
new light "on" left+4.5mm,top+4.5mm
---
(command
  (new
    (light
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


=========================================
new light "on" left+4.5mm,top+4.5mm "LED"
=========================================
new light "on" left+4.5mm,top+4.5mm "LED"
---
(command
  (new
    (light
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset))
        (part))))


====================
new light "on" v1,h1
====================
new light "on" v1,h1
---
(command
  (new
    (light
      (name)
      (x
        (reference))
      (y
        (reference)))))


=============================
new light "on" (parameter X1)
=============================
new light "on" (parameter X1)
---
(command
  (new
    (light
      (name)
      (parameter
        (name)))))


=========================================
new light "on" (parameter X1 +10mm,-10mm)
=========================================
new light "on" (parameter X1 +10mm,-10mm)
---
(command
  (new
    (light
      (name)
      (parameter
        (name)
        (dx)
        (dy)))))


==========================
new light "on" v1,h1 "LED"
==========================
new light "on" v1,h1 "LED"
---
(command
  (new
    (light
      (name)
      (x
        (reference))
      (y
        (reference))
      (part))))


=================================
new light "on" v1+4.5mm,h1-12.5mm
=================================
new light "on" v1+4.5mm,h1-12.5mm
---
(command
  (new
    (light
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


=======================================
new light "on" v1+4.5mm,h1-12.5mm "LED"
=======================================
new light "on" v1+4.5mm,h1-12.5mm "LED"
---
(command
  (new
    (light
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset))
      (part))))


=================================
new light "on" (parameter X1) LED
=================================
new light "on" (parameter X1) LED
---
(command
  (new
    (light
      (name)
      (parameter
        (name))
      (part))))


=============================================
new light "on" (parameter X1 +10mm,-10mm) LED
=============================================
new light "on" (parameter X1 +10mm,-10mm) LED
---
(command
  (new
    (light
      (name)
      (parameter
        (name)
        (dx)
        (dy))
      (part))))


=============================================
new light "on" (parameter X1 +10mm,+10mm) LED
=============================================
new light "on" (parameter X1 +10mm,+10mm) LED
---
(command
  (new
    (light
      (name)
      (parameter
        (name)
        (dx)
        (dy))
      (part))))


===============
delete light l1
===============
delete light l1
---
(command
  (delete
    (light
      (identifier))))


================
delete light LED
================
delete light LED
---
(command
  (delete
    (light
      (identifier))))

        
==================
delete light "LED"
==================
delete light "LED"
---
(command
  (delete
    (light
      (identifier))))


==================
delete light 'LED'
==================
delete light 'LED'
---
(command
  (delete
    (light
      (identifier))))


=============================
set light recording name mute
=============================
set light recording name nute
---
(command
  (set
    (light
      (identifier))
    (name)))


=================================
set light 'recording' name 'mute'
=================================
set light 'recording' name 'mute'
---
(command
  (set
    (light
      (identifier))
    (name)))


=================================
set light "recording" name "mute"
=================================
set light "recording" name "mute"
---
(command
  (set
    (light
      (identifier))
    (name)))


=============================
set light 'recording' x @10mm
=============================
set light 'recording' x @10mm
---
(command
  (set
    (light
      (identifier))
    (x
      (absolute)
      (offset))))


============================
set light 'recording' x 10mm
============================
set light 'recording' x 10mm
---
(command
  (set
    (light
      (identifier))
    (x
      (offset))))


=================================
set light 'recording' x left+10mm
=================================
set light 'recording' x left+10mm
---
(command
  (set
    (light
      (identifier))
    (x
      (reference)
      (offset))))


===============================
set light 'recording' x v1+10mm
===============================
set light 'recording' x v1+10mm
---
(command
  (set
    (light
      (identifier))
    (x
      (reference)
      (offset))))


=============================
set light 'recording' y @10mm
=============================
set light 'recording' y @10mm
---
(command
  (set
    (light
      (identifier))
    (y
      (absolute)
      (offset))))


============================
set light 'recording' y 10mm
============================
set light 'recording' y 10mm
---
(command
  (set
    (light
      (identifier))
    (y
      (offset))))


================================
set light 'recording' y top+10mm
================================
set light 'recording' y top+10mm
---
(command
  (set
    (light
      (identifier))
    (y
      (reference)
      (offset))))


===============================
set light 'recording' y h1+10mm
===============================
set light 'recording' y h1+10mm
---
(command
  (set
    (light
      (identifier))
    (y
      (reference)
      (offset))))


===================================
set light 'recording' xy @10mm,10mm
===================================
set light 'recording' xy @10mm,10mm
---
(command
  (set
    (light
      (identifier))
    (xy
      (absolute)
      (x
        (offset))
      (y
        (offset)))))


==================================
set light 'recording' xy 10mm,10mm
==================================
set light 'recording' xy 10mm,10mm
---
(command
  (set
    (light
      (identifier))
    (xy
      (x
        (offset))
      (y
        (offset)))))


==============================================
set light 'recording' xy left+10mm,middle+10mm
==============================================
set light 'recording' xy left+10mm,middle+10mm
---
(command
  (set
    (light
      (identifier))
    (xy
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


========================================
set light 'recording' xy v1+10mm,h2+10mm
========================================
set light 'recording' xy v1+10mm,h2+10mm
---
(command
  (set
    (light
      (identifier))
    (xy
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


========================================
set light recording x (parameter volume)
========================================
set light recording x (parameter volume)
---
(command
  (set
    (light
      (identifier))
    (x
      (parameter
        (name)))))


=============================================
set light recording x (parameter volume +10mm)
=============================================
set light recording x (parameter volume +10mm)
---
(command
  (set
    (light
      (identifier))
    (x
      (parameter
        (name)
        (offset)))))


========================================
set light recording y (parameter volume)
========================================
set light recording y (parameter volume)
---
(command
  (set
    (light
      (identifier))
    (y
      (parameter
        (name)))))


==============================================
set light recording y (parameter volume +10mm)
==============================================
set light recording y (parameter volume +10mm)
---
(command
  (set
    (light
      (identifier))
    (y
      (parameter
        (name)
        (offset)))))

=========================================
set light recording xy (parameter volume)
=========================================
set light recording xy (parameter volume)
---
(command
  (set
    (light
      (identifier))
    (xy
      (parameter
        (name)))))

=====================================================
set light recording xy (parameter volume +10mm,+10mm)
=====================================================
set light recording xy (parameter volume +10mm,+10mm)
---
(command
  (set
    (light
      (identifier))
    (xy
      (parameter
        (name)
        (x
          (offset))
        (y
          (offset))))))


===================================
set light 'recording' part 'PJ301M'
===================================
set light 'recording' part 'PJ301M'
---
(command
  (set
    (light
      (identifier))
    (part)))


===============================
set light 'recording' part none
===============================
set light 'recording' part none
---
(command
  (set
    (light
      (identifier))
    (part)))

