=======================
new module "woot" 1U 3H
=======================
new module "woot" 1U 3H
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


=======================
new module 'woot' 1U 3H
=======================
new module 'woot' 1U 3H
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


=====================
new module woot 1U 3H
=====================
new module woot 1U 3H
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


=========================
new module <name> <width>
=========================
new module "woot" 3H
---
(command
  (new
    (module
      (name)
      (width))))


