================
new module thing
================
new module thing
---
(command
  (new
    (module
      (name)
      (MISSING width))))

===================
new module thing 3H
===================
new module thing 3H
---
(command
  (new
    (module
      (name)
      (width))))

========================
new module "thing" 1U 3H
========================
new module "thing" 1U 3H
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


========================
new module 'thing' 1U 3H
========================
new module 'thing' 1U 3H
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


======================
new module thing 1U 3H
======================
new module thing 1U 3H
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


===============================
new module "thing" 128.5mm 50mm
===============================
new module "thing" 128.5mm 50mm
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


=====================
new module "thing" 3H
=====================
new module "thing" 3H
---
(command
  (new
    (module
      (name)
      (width))))


=======================
set module name "thing"
=======================
set module name "thing"
---
(command
  (set
    (module
      (name))))


====================
set module height 1U
====================
set module height 1U
---
(command
  (set
    (module
      (height))))


=====================
set module width 50mm
=====================
set module width 50mm
---
(command
  (set
    (module
      (width))))
