================
new module thing
================
new module thing
---
(command
  (new
    (module
      (name)
      (MISSING width))))

========================
new module "thing" 1U 3H
========================
new module "thing" 1U 3H
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


========================
new module 'thing' 1U 3H
========================
new module 'thing' 1U 3H
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


======================
new module thing 1U 3H
======================
new module thing 1U 3H
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


===============================
new module "thing" 128.5mm 50mm
===============================
new module "thing" 128.5mm 50mm
---
(command
  (new
    (module
      (name)
      (height)
      (width))))


=====================
new module "thing" 3H
=====================
new module "thing" 3H
---
(command
  (new
    (module
      (name)
      (width))))


