========================
new param "E" @10mm,10mm
========================
new param "E" @10mm,10mm
---
(command
  (new
    (parameter
      (name)
      (absolute
        (x)
        (y)))))


=======================
new param "E" 10mm,10mm
=======================
new param "E" 10mm,10mm
---
(command
  (new
    (parameter
      (name)
      (relative
        (x)
        (y)))))


=========================
new parameter E 10mm,10mm
=========================
new parameter E 10mm,10mm
---
(command
  (new
    (parameter
      (name)
      (relative
        (x)
        (y)))))


===========================
new parameter 'E' 10mm,10mm
===========================
new parameter 'E' 10mm,10mm
---
(command
  (new
    (parameter
      (name)
      (relative
        (x)
        (y)))))


===========================
new parameter "E" 10mm,10mm
===========================
new parameter "E" 10mm,10mm
---
(command
  (new
    (parameter
      (name)
      (relative
        (x)
        (y)))))


==========================================
new parameter "E" 10mm,10mm RoundBlackKnob
==========================================
new parameter "E" 10mm,10mm RoundBlackKnob
---
(command
  (new
    (parameter
      (name)
      (relative
        (x)
        (y))
      (part))))


==============================================
new parameter "E" 10mm,10mm 'Round Black Knob'
==============================================
new parameter "E" 10mm,10mm 'Round Black Knob'
---
(command
  (new
    (parameter
      (name)
      (relative
        (x)
        (y))
      (part))))


==============================================
new parameter "E" 10mm,10mm "Round Black Knob"
==============================================
new parameter "E" 10mm,10mm "Round Black Knob"
---
(command
  (new
    (parameter
      (name)
      (relative
        (x)
        (y))
      (part))))

==========================
new parameter "E" left,top
==========================
new parameter "E" left,top
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference)))))


===========================================
new parameter "E" left,top "RoundBlackKnob"
===========================================
new parameter "E" left,top "RoundBlackKnob"
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference))
      (part))))


======================================
new parameter "E" left+4.5mm,top+4.5mm
======================================
new parameter "E" left+4.5mm,top+4.5mm
---
(command
  (new
    (parameter
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


=======================================================
new parameter "E" left+4.5mm,top+4.5mm "RoundBlackKnob"
=======================================================
new parameter "E" left+4.5mm,top+4.5mm "RoundBlackKnob"
---
(command
  (new
    (parameter
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset))
      (part))))


=======================
new parameter "E" v1,h1
=======================
new parameter "E" v1,h1
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference)))))


========================================
new parameter "E" v1,h1 "RoundBlackKnob"
========================================
new parameter "E" v1,h1 "RoundBlackKnob"
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference))
      (part))))


===================================
new parameter "E" v1+4.5mm,h1+4.5mm
===================================
new parameter "E" v1+4.5mm,h1+4.5mm
---
(command
  (new
    (parameter
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


====================================================
new parameter "E" v1+4.5mm,h1+4.5mm "RoundBlackKnob"
====================================================
new parameter "E" v1+4.5mm,h1+4.5mm "RoundBlackKnob"
---
(command
  (new
    (parameter
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset))
      (part))))


=========================================================
new parameter "E" (input in +10mm,+10mm) "RoundBlackKnob"
=========================================================
new parameter "E" (input in +10mm,+10mm) "RoundBlackKnob"
---
(command
  (new
    (parameter
      (name)
      (input
        (name)
        (dx)
        (dy))
      (part))))


===================
delete parameter p1
===================
delete parameter p1
---
(command
  (delete
    (parameter
      (identifier))))


=========================
delete parameter volume_1
=========================
delete parameter volume_1
---
(command
  (delete
    (parameter
      (identifier))))

        
===========================
delete parameter "volume_1"
===========================
delete parameter "volume_1"
---
(command
  (delete
    (parameter
      (identifier))))


===========================
delete parameter 'volume-1'
===========================
delete parameter 'volume-1'
---
(command
  (delete
    (parameter
      (identifier))))


===========================
delete parameter 'volume 1'
===========================
delete parameter 'volume 1'
---
(command
  (delete
    (parameter
      (identifier))))


==============================
set parameter volume name gain
==============================
set parameter volume name gain
---
(command
  (set
    (parameter
      (identifier))
    (name)))


===================================
set parameter 'volume' name 'right'
===================================
set parameter 'volume' name 'right'
---
(command
  (set
    (parameter
      (identifier))
    (name)))


===================================
set parameter "volume" name "right"
===================================
set parameter "volume" name "right"
---
(command
  (set
    (parameter
      (identifier))
    (name)))


==============================
set parameter 'volume' x @10mm
==============================
set parameter 'volume' x @10mm
---
(command
  (set
    (parameter
      (identifier))
    (x
      (absolute)
      (offset))))


=============================
set parameter 'volume' x 10mm
=============================
set parameter 'volume' x 10mm
---
(command
  (set
    (parameter
      (identifier))
    (x
      (offset))))


==================================
set parameter 'volume' x left+10mm
==================================
set parameter 'volume' x left+10mm
---
(command
  (set
    (parameter
      (identifier))
    (x
      (reference)
      (offset))))


================================
set parameter 'volume' x v1+10mm
================================
set parameter 'volume' x v1+10mm
---
(command
  (set
    (parameter
      (identifier))
    (x
      (reference)
      (offset))))


==============================
set parameter 'volume' y @10mm
==============================
set parameter 'volume' y @10mm
---
(command
  (set
    (parameter
      (identifier))
    (y
      (absolute)
      (offset))))


=============================
set parameter 'volume' y 10mm
=============================
set parameter 'volume' y 10mm
---
(command
  (set
    (parameter
      (identifier))
    (y
      (offset))))


=================================
set parameter 'volume' y top+10mm
=================================
set parameter 'volume' y top+10mm
---
(command
  (set
    (parameter
      (identifier))
    (y
      (reference)
      (offset))))


================================
set parameter 'volume' y h1+10mm
================================
set parameter 'volume' y h1+10mm
---
(command
  (set
    (parameter
      (identifier))
    (y
      (reference)
      (offset))))


====================================
set parameter 'volume' xy @10mm,10mm
====================================
set parameter 'volume' xy @10mm,10mm
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (absolute)
      (x
        (offset))
      (y
        (offset)))))


===================================
set parameter 'volume' xy 10mm,10mm
===================================
set parameter 'volume' xy 10mm,10mm
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (x
        (offset))
      (y
        (offset)))))


===============================================
set parameter 'volume' xy left+10mm,middle+10mm
===============================================
set parameter 'volume' xy left+10mm,middle+10mm
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


=========================================
set parameter 'volume' xy v1+10mm,h2+10mm
=========================================
set parameter 'volume' xy v1+10mm,h2+10mm
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


==================================
set parameter volume x (input in)
==================================
set parameter volume x (input in)
---
(command
  (set
    (parameter
      (identifier))
    (x
      (input
        (name)))))


=======================================
set parameter volume x (input in +10mm)
=======================================
set parameter volume x (input in +10mm)
---
(command
  (set
    (parameter
      (identifier))
    (x
      (input
        (name)
        (offset)))))


=================================
set parameter volume y (input in)
=================================
set parameter volume y (input in)
---
(command
  (set
    (parameter
      (identifier))
    (y
      (input
        (name)))))


=======================================
set parameter volume y (input in +10mm)
=======================================
set parameter volume y (input in +10mm)
---
(command
  (set
    (parameter
      (identifier))
    (y
      (input
        (name)
        (offset)))))

==================================
set parameter volume xy (input in)
==================================
set parameter volume xy (input in)
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (input
        (name)))))

==============================================
set parameter volume xy (input in +10mm,+10mm)
==============================================
set parameter volume xy (input in +10mm,+10mm)
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (input
        (name)
        (x
          (offset))
        (y
          (offset))))))

====================================
set parameter 'volume' part 'PJ301M'
====================================
set parameter 'volume' part 'PJ301M'
---
(command
  (set
    (parameter
      (identifier))
    (part)))


================================
set parameter 'volume' part none
================================
set parameter 'volume' part none
---
(command
  (set
    (parameter
      (identifier))
    (part)))


