============================
new parameter "E" @10mm,10mm
============================
new parameter "E" @10mm,10mm
---
(command
  (new
    (parameter
      (name)
      (absolute
        (x)
        (y)))))


=======================================
new param "E" @10mm,10mm RoundBlackKnob
=======================================
new param "E" @10mm,10mm RoundBlackKnob
---
(command
  (new
    (parameter
      (name)
      (absolute
        (x)
        (y))
      (part))))


===========================================
new param "E" @10mm,10mm "Round Black Knob"
===========================================
new param "E" @10mm,10mm "Round Black Knob"
---
(command
  (new
    (parameter
      (name)
      (absolute
        (x)
        (y))
      (part))))

=========================================
new param "E" @10mm,10mm 'Round Black Knob'
=========================================
new param "E" @10mm,10mm 'Round Black Knob'
---
(command
  (new
    (parameter
      (name)
      (absolute
        (x)
        (y))
      (part))))


======================
new param "E" left,top
======================
new param "E" left,top
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference)))))


=======================================
new param "E" left,top "RoundBlackKnob"
=======================================
new param "E" left,top "RoundBlackKnob"
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference))
      (part))))


==================================
new param "E" left+4.5mm,top+4.5mm
==================================
new param "E" left+4.5mm,top+4.5mm
---
(command
  (new
    (parameter
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


===================================================
new param "E" left+4.5mm,top+4.5mm "RoundBlackKnob"
===================================================
new param "E" left+4.5mm,top+4.5mm "RoundBlackKnob"
---
(command
  (new
    (parameter
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset))
      (part))))


===================
new param "E" v1,h1
===================
new param "E" v1,h1
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference)))))


====================================
new param "E" v1,h1 "RoundBlackKnob"
====================================
new param "E" v1,h1 "RoundBlackKnob"
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference))
      (part))))


===============================
new param "E" v1+4.5mm,h1+4.5mm
===============================
new param "E" v1+4.5mm,h1+4.5mm
---
(command
  (new
    (parameter
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset)))))


================================================
new param "E" v1+4.5mm,h1+4.5mm "RoundBlackKnob"
================================================
new param "E" v1+4.5mm,h1+4.5mm "RoundBlackKnob"
---
(command
  (new
    (parameter
      (name)
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset))
      (part))))
