=======================
new param "E" @30°,10mm
=======================
new param "E" @30°,10mm
---
(command
  (new
    (parameter
      (name)
      (absolute
        (polar
          (angle)
          (radius))))))

========================
new param "E" @+30°,10mm
========================
new param "E" @+30°,10mm
---
(command
  (new
    (parameter
      (name)
      (absolute
        (polar
          (angle)
          (radius))))))

========================
new param "E" @-30°,10mm
========================
new param "E" @-30°,10mm
---
(command
  (new
    (parameter
      (name)
      (absolute
        (polar
          (angle)
          (radius))))))

=========================
new param "E" @30deg,10mm
=========================
new param "E" @30deg,10mm
---
(command
  (new
    (parameter
      (name)
      (absolute
        (polar
          (angle)
          (radius))))))

=============================
new param "E" @30degrees,10mm
=============================
new param "E" @30degrees,10mm
---
(command
  (new
    (parameter
      (name)
      (absolute
        (polar
          (angle)
          (radius))))))

=======================
new param "E" 30°,10mm
=======================
new param "E" 30°,10mm
---
(command
  (new
    (parameter
      (name)
      (relative
        (polar
          (angle)
          (radius))))))

========================
new param "E" +30°,10mm
========================
new param "E" +30°,10mm
---
(command
  (new
    (parameter
      (name)
      (relative
        (polar
          (angle)
          (radius))))))

========================
new param "E" -30°,10mm
========================
new param "E" -30°,10mm
---
(command
  (new
    (parameter
      (name)
      (relative
        (polar
          (angle)
          (radius))))))

========================
new param "E" 30deg,10mm
========================
new param "E" 30deg,10mm
---
(command
  (new
    (parameter
      (name)
      (relative
        (polar
          (angle)
          (radius))))))

============================
new param "E" 30degrees,10mm
============================
new param "E" 30degrees,10mm
---
(command
  (new
    (parameter
      (name)
      (relative
        (polar
          (angle)
          (radius))))))

=====================================
new parameter "E" (input in 30°,10mm)
=====================================
new parameter "E" (input in 30°,10mm)
---
(command
  (new
    (parameter
      (name)
      (input
        (name)
        (polar
          (angle)
          (radius))))))

======================================
new parameter "E" (input in +30°,10mm)
======================================
new parameter "E" (input in +30°,10mm)
---
(command
  (new
    (parameter
      (name)
      (input
        (name)
        (polar
          (angle)
          (radius))))))

======================================
new parameter "E" (input in -30°,10mm)
======================================
new parameter "E" (input in -30°,10mm)
---
(command
  (new
    (parameter
      (name)
      (input
        (name)
        (polar
          (angle)
          (radius))))))

=======================================
new parameter "E" (input in 30deg,10mm)
=======================================
new parameter "E" (input in 30deg,10mm)
---
(command
  (new
    (parameter
      (name)
      (input
        (name)
        (polar
          (angle)
          (radius))))))

===========================================
new parameter "E" (input in 30degrees,10mm)
===========================================
new parameter "E" (input in 30degrees,10mm)
---
(command
  (new
    (parameter
      (name)
      (input
        (name)
        (polar
          (angle)
          (radius))))))

=========================
new parameter "E" (v1,h1)
=========================
new parameter "E" (v1,h1)
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference)))))

==================================
new parameter "E" (v1,h1 30°,10mm)
==================================
new parameter "E" (v1,h1 30°,10mm)
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference))
      (polar
        (angle)
        (radius)))))

==========================================
new parameter "E" (centre,middle 30°,10mm)
==========================================
new parameter "E" (centre,middle 30°,10mm)
---
(command
  (new
    (parameter
      (name)
      (x
        (reference))
      (y
        (reference))
      (polar
        (angle)
        (radius)))))

==============================
set parameter "E" xy @30°,10mm
==============================
set parameter "E" xy @30°,10mm
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (absolute)
      (polar
        (angle)
        (radius)))))

=============================
set parameter "E" xy 30°,10mm
=============================
set parameter "E" xy 30°,10mm
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (polar
        (angle)
        (radius)))))

================================================
set parameter 'volume' xy (left,middle 30°,10mm)
================================================
set parameter 'volume' xy (left,middle 30°,10mm)
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (x
        (reference))
      (y
        (reference))
      (polar
        (angle)
        (radius)))))

==========================================================
set parameter 'volume' xy (left+10mm,middle+12mm 30°,10mm)
==========================================================
set parameter 'volume' xy (left+10mm,middle+12mm 30°,10mm)
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset))
      (polar
        (angle)
        (radius)))))


=====================================
set parameter "E" xy (v1,h2 30°,10mm)
=====================================
set parameter "E" xy (v1,h2 30°,10mm)
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (x
        (reference))
      (y
        (reference))
      (polar
        (angle)
        (radius)))))

===============================================
set parameter "E" xy (v1+10mm,h2+10mm 30°,10mm)
===============================================
set parameter "E" xy (v1+10mm,h2+10mm 30°,10mm)
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (x
        (reference)
        (offset))
      (y
        (reference)
        (offset))
      (polar
        (angle)
        (radius)))))

========================================
set parameter "E" xy (input in 30°,10mm)
========================================
set parameter "E" xy (input in 30°,10mm)
---
(command
  (set
    (parameter
      (identifier))
    (xy
      (input
        (name)
        (polar 
          (angle)
          (radius))))))

